/*
 * Напиши скрипт обробки покупки в магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сумма покупки зберігається в змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
 * доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з балансу суму покупки
 *    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */

let balance = 10000;
const payment = 20000;


// 1. alert  з повідомленням «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
//  * доступних коштів на рахунку»

// 2.Зробити перевірку balance > payment 
// 3.відняти суму покупкиі вивести повідомлення з залишком на рахунку 
// 4. balance < payment  виводимо повідомлення


// 'Все добре, знімаємо гроші... Дякуємо за покупку!'