/*
 * Оператор розгалуження if
 */

// console.log('До розгалуження');

// if(5 > 3 ){
//     console.log('Всередині розгалуження');
// }

// console.log('Після розгалуження');

/*
 * Оператор розгалуження if...else
 */

// console.log(Boolean('vip'));

// if('vip'){
//     console.log('Ви отримуєте доступ');
// } else {
//     console.log('У вас немає доступу');
// }

/*
 * Оператор розгалуження else...if
 */

// const salary = 500;

// if (salary < 1000){
//     console.log("Level 1");
// } else if(salary > 2000 && salary < 3000){
//     console.log('Level 2');
// } else if (salary > 3000 && salary < 4000){
//     console.log('Level 3');
// } else {
//     console.log('Ти не наш робітник!');
// }

/*
 * Тернарний оператор
 */

const salary = 5000;
// let message;

// if(salary <= 5000){
//    message = 'Ваша зп менше 5000!' ;   
// } else {
//    message = 'Ваша зп більше 5000!' ;
// }

// console.log(message);

const message = salary <= 5000 ? 'Ваша зп менше 5000!' : 'Ваша зп більше 5000!';

// console.log(message);
/*
 * Блочна область видимості змінних
 */

const a = 5;
const b = 15;
console.log(a);

if(true){
    const b = 10;
    console.log(b);
    console.log(a);
}

console.log(b);











/*
 * Напиши скрипт обробки покупки в магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сумма покупки зберігається в змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість 
 * доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з балансу суму покупки
 *    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */
// let balance = 10000;
// const payment = 20000;
// // 1.виводимо повідомлення
// // 2. перевіряємо payment < balance і віднімаємо сумму і виводимо повідомлення
// // 3. перевіряємо payment > balance і виводимо повідомлення
// // 4. вивести повідомлення «Операція завершена»

// alert(`Загальна вартість замовлення ${payment} кредитів. Перевіряємо кількість 
//      доступних коштів на рахунку`)

// if(payment <= balance){
//     balance -= payment;
// console.log(`На рахунку залишилося ${balance} кредитів`);
// } else {
//     console.log(`На рахунку недостатньо коштів для проведення операції!`);
// } 
// console.log('Операція завершена');

// 'Все добре, знімаємо гроші... Дякуємо за покупку!'


// ПРАКТИЧНА ЗАДАЧА 2
/*
 * Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */

// const totalSpent = 2000;
// let payment = 500;
// let discount = 0;

// 'Бронзовий партнер, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'