/*
 *  Приведення до булю на прикладі Boolean(value)
 */

// console.log(Boolean(0));

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те на чому запнулось або останній операнд
 */

// console.log(5 && 4 && 7 && 'mango');

/*
 * Логічне АБО (оператор ||)
 * - Запинаєтьс на правді
 * - Повертає те на чому запнулось або останній операнд
 */

// console.log(false || 5 || null || 0);

/*
 * Логічне НІ (оператор !)
 * Робить інверсію правда > брехня та брехня > правда
 */

console.log(!5);
