/*
 *  Приведення до булю на прикладі Boolean(value)
 */

// console.log(Boolean('false'));

/*
 * Логічне І (оператор &&)
 * - Запинається на брехні
 * - Повертає те на чому запнулось або останній операнд
 */

// console.log('' && 4 && 0 && true && 1);

/*
 * Логічне АБО (оператор ||)
 * - Запинаєтьс на правді
 * - Повертає те на чому запнулось або останній операнд
 */

// console.log(false || 5 || null || 'ghjghg');

/*
 * Логічне НІ (оператор !)
 * Робить інверсію правда > брехня та брехня > правда
 */

console.log(!false);
